const tasks = [
  {
    id: 1,
    text: "(ЕГЭ-2023) Производилась двухканальная (стерео) звукозапись с частотой дискретизации 48 кГц и 24-битным разрешением. В результате получен файл размером 288 Мбайт без учёта размера заголовка и без сжатия данных. Определите длительность звукозаписи (в минутах). В качестве ответа укажите ближайшее к полученному времени записи целое число. 123",
    answer: 123,
    nomer_ege: 7,
  },
  {
    id: 2,
    text: "(ЕГЭ-2022) Для хранения произвольного растрового изображения размером 1024 на 120 пикселей отведено 210 Кбайт памяти без учёта размера заголовка файла. При кодировании каждого пикселя используется 7 бит для определения степени прозрачности и одинаковое количество бит для указания его цвета. Коды пикселей записываются в файл один за другим без промежутков. Какое максимальное количество цветов (без учета степени прозрачности) можно использовать в изображении? 234",
    answer: 234,
    nomer_ege: 7,
  },
  {
    id: 3,
    text: "Производится двухканальная (стерео) звукозапись с частотой дискретизации 48 кГц. Запись длится 2 минуты 15 секунд, её результаты записываются в файл без сжатия данных, причём каждый сигнал кодируется минимально возможным и одинаковым количеством бит. Информационный объём полученного файла без учета заголовка не превышает 32 Мбайт. Определите максимальную битовую глубину кодирования звука, которая могла быть использована в этой записи. В ответе запишите только число. 345",
    answer: 345,
    nomer_ege: 7,
  },
];

export default tasks;
